#!/bin/bash

echo "======================================="

echo "   HWLang v2.7: Linux System Installer "

echo "======================================="

if [ ! -f "hwlang" ]; then

    echo "Ошибка: Файл hwlang не найден на рабочем столе!"

    echo "Сначала набери 'make', чтобы собрать его."

    exit 1

fi

echo "[1/3] Настройка прав доступа..."

chmod +x hwlang

echo "[2/3] Копирование в системную директорию /usr/local/bin..."

sudo cp hwlang /usr/local/bin/

echo "[3/3] Очистка временных файлов..."

echo "---------------------------------------"

echo "УСТАНОВКА ЗАВЕРШЕНА!"

echo "Теперь ты можешь написать 'hwlang' в любом месте терминала."

echo "======================================="
